workspace_go/services/http_gateway/docs/benchmarks/results/double-buffer/test-none-cpu1-hey.txt

Summary:
  Total:	87.8446 secs
  Slowest:	0.0505 secs
  Fastest:	0.0002 secs
  Average:	0.0176 secs
  Requests/sec:	11383.7429
  
  Total data:	52000000 bytes
  Size/request:	52 bytes

Response time histogram:
  0.000 [1]	|
  0.005 [83]	|
  0.010 [192]	|
  0.015 [902]	|
  0.020 [865977]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.025 [132648]	|■■■■■■
  0.030 [50]	|
  0.035 [21]	|
  0.040 [50]	|
  0.045 [53]	|
  0.051 [23]	|


Latency distribution:
  10%% in 0.0161 secs
  25%% in 0.0164 secs
  50%% in 0.0170 secs
  75%% in 0.0179 secs
  90%% in 0.0207 secs
  95%% in 0.0213 secs
  99%% in 0.0222 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0060 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0037 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0028 secs
  resp wait:	0.0175 secs, 0.0002 secs, 0.0443 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0004 secs

Status code distribution:
  [201]	1000000 responses