workspace_go/services/http_gateway/docs/benchmarks/results/double-buffer/test-none-cpu16-hey.txt

Summary:
  Total:	6.9437 secs
  Slowest:	0.0622 secs
  Fastest:	0.0002 secs
  Average:	0.0014 secs
  Requests/sec:	144015.4828
  
  Total data:	52000000 bytes
  Size/request:	52 bytes

Response time histogram:
  0.000 [1]	|
  0.006 [998881]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.013 [836]	|
  0.019 [39]	|
  0.025 [51]	|
  0.031 [10]	|
  0.037 [8]	|
  0.044 [77]	|
  0.050 [36]	|
  0.056 [22]	|
  0.062 [39]	|


Latency distribution:
  10%% in 0.0008 secs
  25%% in 0.0010 secs
  50%% in 0.0013 secs
  75%% in 0.0016 secs
  90%% in 0.0020 secs
  95%% in 0.0023 secs
  99%% in 0.0034 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0094 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0018 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0083 secs
  resp wait:	0.0013 secs, 0.0001 secs, 0.0581 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0037 secs

Status code distribution:
  [201]	1000000 responses