workspace_go/services/http_gateway/docs/benchmarks/results/double-buffer/test-none-cpu4-hey.txt

Summary:
  Total:	22.1230 secs
  Slowest:	0.0154 secs
  Fastest:	0.0001 secs
  Average:	0.0044 secs
  Requests/sec:	45201.8826
  
  Total data:	52000000 bytes
  Size/request:	52 bytes

Response time histogram:
  0.000 [1]	|
  0.002 [8917]	|■
  0.003 [159769]	|■■■■■■■■■■■■■■
  0.005 [453869]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.006 [292885]	|■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.008 [71079]	|■■■■■■
  0.009 [11507]	|■
  0.011 [1568]	|
  0.012 [315]	|
  0.014 [49]	|
  0.015 [41]	|


Latency distribution:
  10%% in 0.0028 secs
  25%% in 0.0035 secs
  50%% in 0.0043 secs
  75%% in 0.0052 secs
  90%% in 0.0061 secs
  95%% in 0.0067 secs
  99%% in 0.0080 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0033 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0003 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0011 secs
  resp wait:	0.0044 secs, 0.0001 secs, 0.0154 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0022 secs

Status code distribution:
  [201]	1000000 responses